Revit 2026 API

# ParameterDescription Property

---

Returns the tooltip information for a parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Description { get; set; }
```
```vb
Public Property Description As String
	Get
	Set
```
```cpp
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Description : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if this parameter is built-in. |

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace